In [5]:
import pandas as pd

In [6]:
employee5 = pd.DataFrame({
                    'EID': [1,2,3,4,5,6,7,8,9,10],
                    'ENAME' : ['praveen', 'Amit', 'Rohit', 'Mohan', 'sohan', 'Rohan', 'Meena', 'Sheena', 'Tina','Mona'],
                    'ELOC' : ['pune', 'Agra', 'Delhi', 'jaipur', 'udaipur', 'Nagpur', 'Yavatmal', 'Wardha', 'Nanded', 'Latur'],
                    'Dept' : ['finance', 'HR', 'Finance', 'Testing', 'Dev', 'Account','HR', 'Finance', 'Account','Dev' ],
                    'sal' : [20000, 30000, 40000, 20000, 50000, 60000, 70000, 80000, 90000, 75000],
                    'Gender' : ['Male',None,'Male', None,'Male',None,'Male', None,'Male',None]
    
})

In [7]:
employee5

   EID    ENAME      ELOC     Dept    sal Gender
0    1  praveen      pune  finance  20000   Male
1    2     Amit      Agra       HR  30000   None
2    3    Rohit     Delhi  Finance  40000   Male
3    4    Mohan    jaipur  Testing  20000   None
4    5    sohan   udaipur      Dev  50000   Male
5    6    Rohan    Nagpur  Account  60000   None
6    7    Meena  Yavatmal       HR  70000   Male
7    8   Sheena    Wardha  Finance  80000   None
8    9     Tina    Nanded  Account  90000   Male
9   10     Mona     Latur      Dev  75000   None

In [8]:
# sql agrrigate functions min , max, sum, avg, count, top, null, distinct
# pandas  functions min , max, sum, mean, count, mean, median, mode,

In [9]:
# find the totol of the salary 
# select sum(sal) from employee5;
total = employee5['sal'].min()
total
# same for remainig functions also min, max,

20000

In [10]:
# find the second minimun salary 
# select min(sal) from employee5 where sal <> (select  min(sal) from  employee5);  or
# select min(sal) from employee5 where sal not in (select  min(sal) from  employee5);
second_highest = employee5['sal'].nlargest(2).iloc[-1]

In [11]:
second_highest

80000

In [12]:
# remove the duplicate values from the Dept columm
#select distinct( Dept) from employee5
df_duplicates = employee5.drop_duplicates(subset='Dept', keep='first')
df_duplicates

   EID    ENAME     ELOC     Dept    sal Gender
0    1  praveen     pune  finance  20000   Male
1    2     Amit     Agra       HR  30000   None
2    3    Rohit    Delhi  Finance  40000   Male
3    4    Mohan   jaipur  Testing  20000   None
4    5    sohan  udaipur      Dev  50000   Male
5    6    Rohan   Nagpur  Account  60000   None

In [13]:
employee5

   EID    ENAME      ELOC     Dept    sal Gender
0    1  praveen      pune  finance  20000   Male
1    2     Amit      Agra       HR  30000   None
2    3    Rohit     Delhi  Finance  40000   Male
3    4    Mohan    jaipur  Testing  20000   None
4    5    sohan   udaipur      Dev  50000   Male
5    6    Rohan    Nagpur  Account  60000   None
6    7    Meena  Yavatmal       HR  70000   Male
7    8   Sheena    Wardha  Finance  80000   None
8    9     Tina    Nanded  Account  90000   Male
9   10     Mona     Latur      Dev  75000   None

In [14]:
df3 = employee5.fillna({'Gender': 'Female'})  # Fill specific columns with values

In [15]:
df3

   EID    ENAME      ELOC     Dept    sal  Gender
0    1  praveen      pune  finance  20000    Male
1    2     Amit      Agra       HR  30000  Female
2    3    Rohit     Delhi  Finance  40000    Male
3    4    Mohan    jaipur  Testing  20000  Female
4    5    sohan   udaipur      Dev  50000    Male
5    6    Rohan    Nagpur  Account  60000  Female
6    7    Meena  Yavatmal       HR  70000    Male
7    8   Sheena    Wardha  Finance  80000  Female
8    9     Tina    Nanded  Account  90000    Male
9   10     Mona     Latur      Dev  75000  Female

In [16]:
#df2 = employee5.['Gender'] = employee5['Gender'].fillna('Female')

import pandas as pd

# Example DataFrame
data = {'Gender': ['Male', 'Female', None, 'Male', None, 'Female']}
df1 = pd.DataFrame(data)

# Fill missing values with 'Female'
#df['Gender'] = df['Gender'].fillna('Female')

print(df1)

In [18]:
#df3 = employee5.['Gender'] = employee5['Gender'].fillna('Female')

# Iloc we are fetching rows and columns by using indexing

[start row : end row :step], or [start row: end row, start column : end column]

In [21]:
df3.iloc[2:7:2]
      #[Start: end : step]
      # [startRow: Endrow, columnname]

   EID  ENAME      ELOC     Dept    sal Gender
2    3  Rohit     Delhi  Finance  40000   Male
4    5  sohan   udaipur      Dev  50000   Male
6    7  Meena  Yavatmal       HR  70000   Male

In [22]:
df3.iloc[2:7,2]

# [start Row:end Row, 2nd column]

2       Delhi
3      jaipur
4     udaipur
5      Nagpur
6    Yavatmal
Name: ELOC, dtype: object

In [23]:
df3.iloc[2:7,2:7]

# [start Row:end Row, start column: end column]

       ELOC     Dept    sal  Gender
2     Delhi  Finance  40000    Male
3    jaipur  Testing  20000  Female
4   udaipur      Dev  50000    Male
5    Nagpur  Account  60000  Female
6  Yavatmal       HR  70000    Male

In [24]:
df3.iloc[5,2:7]
# [start:end]

ELOC       Nagpur
Dept      Account
sal         60000
Gender     Female
Name: 5, dtype: object

In [25]:
df3.iloc[2,2:4]
# [2nd row : 2to4column]

ELOC      Delhi
Dept    Finance
Name: 2, dtype: object

In [26]:
df3.iloc[2:5,2:4]
# [2row to 5th row , 2nd column to 4thcolum ]

      ELOC     Dept
2    Delhi  Finance
3   jaipur  Testing
4  udaipur      Dev

In [27]:
df3.iloc[2,3]
# [2nd row,3rd column]

'Finance'

In [28]:
df3.iloc[[2,4,5],:]
# [2,3,4,5 row : all columns]

   EID  ENAME     ELOC     Dept    sal  Gender
2    3  Rohit    Delhi  Finance  40000    Male
4    5  sohan  udaipur      Dev  50000    Male
5    6  Rohan   Nagpur  Account  60000  Female

In [29]:
df3.iloc[ :, [2, 5] ]
#[all rows: 2nd & 5th column]

       ELOC  Gender
0      pune    Male
1      Agra  Female
2     Delhi    Male
3    jaipur  Female
4   udaipur    Male
5    Nagpur  Female
6  Yavatmal    Male
7    Wardha  Female
8    Nanded    Male
9     Latur  Female

In [30]:
df3.iloc[[2,5,], 2:5]
# [2nd & 5th row: 2nd to 5th column]

     ELOC     Dept    sal
2   Delhi  Finance  40000
5  Nagpur  Account  60000

# loc

In [32]:
df3.loc[2:6]
# [2nd row : to 6th row]

   EID  ENAME      ELOC     Dept    sal  Gender
2    3  Rohit     Delhi  Finance  40000    Male
3    4  Mohan    jaipur  Testing  20000  Female
4    5  sohan   udaipur      Dev  50000    Male
5    6  Rohan    Nagpur  Account  60000  Female
6    7  Meena  Yavatmal       HR  70000    Male

In [33]:
df3.loc[2:8:2]
# [2nd row : to 8th : 1step]

   EID  ENAME      ELOC     Dept    sal Gender
2    3  Rohit     Delhi  Finance  40000   Male
4    5  sohan   udaipur      Dev  50000   Male
6    7  Meena  Yavatmal       HR  70000   Male
8    9   Tina    Nanded  Account  90000   Male

In [68]:
df3.loc[[2,4],:'ELOC']
# [2nd row, 4th row all column nane]

   EID  ENAME     ELOC
2    3  Rohit    Delhi
4    5  sohan  udaipur

In [70]:
df3.loc[3,'ENAME']
# 3rd row Ename column

'Mohan'

In [80]:
df3.loc[2:6,'ENAME']
# [2nd row to 6th row, Name column]

2    Rohit
3    Mohan
4    sohan
5    Rohan
6    Meena
Name: ENAME, dtype: object

In [84]:
df3.loc[2:6,'ENAME':'sal']
# [2nd to 6th row, name to sal column]

   ENAME      ELOC     Dept    sal
2  Rohit     Delhi  Finance  40000
3  Mohan    jaipur  Testing  20000
4  sohan   udaipur      Dev  50000
5  Rohan    Nagpur  Account  60000
6  Meena  Yavatmal       HR  70000

In [92]:
df3.loc[2:7:2]

   EID  ENAME      ELOC     Dept    sal Gender
2    3  Rohit     Delhi  Finance  40000   Male
4    5  sohan   udaipur      Dev  50000   Male
6    7  Meena  Yavatmal       HR  70000   Male

In [102]:
df3.loc[2:7,'ENAME']

2     Rohit
3     Mohan
4     sohan
5     Rohan
6     Meena
7    Sheena
Name: ENAME, dtype: object

In [108]:
df3.loc[2:7,'EID':'sal']

   EID   ENAME      ELOC     Dept    sal
2    3   Rohit     Delhi  Finance  40000
3    4   Mohan    jaipur  Testing  20000
4    5   sohan   udaipur      Dev  50000
5    6   Rohan    Nagpur  Account  60000
6    7   Meena  Yavatmal       HR  70000
7    8  Sheena    Wardha  Finance  80000

In [114]:
df3.loc[2,'ENAME']
# [2nd row, Ename Column]

'Rohit'

In [118]:
df3.loc[2,'EID':'sal']
# [2nd row , Ename column to sal column]

EID            3
ENAME      Rohit
ELOC       Delhi
Dept     Finance
sal        40000
Name: 2, dtype: object

In [120]:
df3.loc[[2,4,5],:]

   EID  ENAME     ELOC     Dept    sal  Gender
2    3  Rohit    Delhi  Finance  40000    Male
4    5  sohan  udaipur      Dev  50000    Male
5    6  Rohan   Nagpur  Account  60000  Female

In [128]:
df3.loc[[2,5], 'EID':'sal'] 
#

   EID  ENAME    ELOC     Dept    sal
2    3  Rohit   Delhi  Finance  40000
5    6  Rohan  Nagpur  Account  60000

In [130]:
df3.loc[df3['ENAME'] == 'Rohit'] 
# [rohit name row will show]

   EID  ENAME   ELOC     Dept    sal Gender
2    3  Rohit  Delhi  Finance  40000   Male

In [136]:
df3.loc[ :, ['EID':'sal']]

SyntaxError: invalid syntax (2792952791.py, line 1)

In [138]:
df3.loc[:, 'EID':'sal']

   EID    ENAME      ELOC     Dept    sal
0    1  praveen      pune  finance  20000
1    2     Amit      Agra       HR  30000
2    3    Rohit     Delhi  Finance  40000
3    4    Mohan    jaipur  Testing  20000
4    5    sohan   udaipur      Dev  50000
5    6    Rohan    Nagpur  Account  60000
6    7    Meena  Yavatmal       HR  70000
7    8   Sheena    Wardha  Finance  80000
8    9     Tina    Nanded  Account  90000
9   10     Mona     Latur      Dev  75000

In [148]:
df3.iloc[2,1]

'Rohit'

In [172]:
#df3.loc[df3[2] == 'Rohit'] 
df3.loc[df3.iloc[:, 0] == 'Rohit']

    Name  EID  Age
2  Rohit  103   35
4  Rohit  105   50

In [156]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Rohit', 'David', 'Rohit'],
    'EID': [101, 102, 103, 104, 105],
    'Age': [24, 30, 35, 40, 50]
}

df3 = pd.DataFrame(data)


print(df3)

    Name  EID  Age
0  Alice  101   24
1    Bob  102   30
2  Rohit  103   35
3  David  104   40
4  Rohit  105   50

In [160]:
# Using positional indexing with .iloc
result_pos = df3.loc[df3.iloc[:, 0] == 'Rohit']  # Select rows where 1st column equals 'Rohit'
print(result_pos)

    Name  EID  Age
2  Rohit  103   35
4  Rohit  105   50

In [158]:
# Using column name directly
result_name = df3.loc[df3['Name'] == 'Rohit']
print(result_name)

    Name  EID  Age
2  Rohit  103   35
4  Rohit  105   50